### You’re given a dataframe containing a list of user IDs and their full names (e.g. ‘James Emerson’). Transform this dataframe into a dataframe that contains the user ids and only the first name of each user.

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame([[1034, 'James Emerson'], [9430, 'Fiona Woodward'], [7281, 'Alvin Gross'], [5264, 'Deborah Handler'], [8995, 'Leah Xue']],
                         columns=['user_id', 'name'])
df.head()

   user_id             name
0     1034    James Emerson
1     9430   Fiona Woodward
2     7281      Alvin Gross
3     5264  Deborah Handler
4     8995         Leah Xue

In [3]:
df[['first name','last name']] = df["name"].str.split(" ", 1, expand=True)
df.drop(columns='name', inplace=True)
df.head()

   user_id first name last name
0     1034      James   Emerson
1     9430      Fiona  Woodward
2     7281      Alvin     Gross
3     5264    Deborah   Handler
4     8995       Leah       Xue

### END